# -*- coding: utf-8 -*-
"""
Created on Sat Sep  7 18:37:48 2024

@author: WUFENG
"""

welcome = """小朋友你好呀，今天我们来进行一个小小的语文阅读测试，但是和之前的测试不同，我们是在电脑上通过对话来进行的。  
        你可以当成是在课堂上老师提问的形式，在这里则是测试小助手会向你提问，你经过思考后进行回答，然后小助手会告诉你你回答的怎么样，你对这道题有任何的疑问
        也可以询问小助手，小助手都会耐心的为你解答。  
        本次小测试时长为xx分钟。包含两篇阅读材料和每篇13个左右的小问，你阅读完屏幕左侧的阅读材料后就可以告诉小助手开始测试了。
        你的回答**通过键盘在屏幕右侧的输入栏中进行输入，每次输入完毕后单击回车键提交输入**，然后等待小助手的回复，就和在微信上和朋友聊天一样，
        注意有时小助手的回答可能会比较慢，请耐心等待哦。**你只有在小助手回复之后才能进行下一次输入**。      
        在你准备好后，在下方的输入栏中输入你的班级和名字，并点击“提交”就可以开始本次测试！
        """
# 阅读材料
reading_material = ["敌人馅饼.pdf","绿海龟的生命旅途.pdf"
]
#测试题目
questions = [
    "1.是谁在说这个故事？<br>A.杰米<br>B.爸爸<br>C.史丹利<br>D.汤姆",
    "2.故事的开始，为什么汤姆会觉得杰米是他的敌人？",
    "3.请写出一样汤姆觉得敌人馅饼里面会有的成分。",
    "4.找到材料中带有下划线的那一段，为什么汤姆会认为那还可以是一个美好的夏天？",
    "5.当汤姆一开始闻到敌人馅饼的味道时，他有什么感觉?请说明他为什么会有这样的感觉。"
]